## Pandas Series and Data Frames

### Series
### 1. Form of sequentially one-dimensional array
### 2. All elements one data type
### 3. Can be created from lists,tuples and arrays

### DataFrame
### two dimensional data structure that can store various types of data

### Note: The main difference between Series and Frame is that series is uni-dimensional whereas DataFrame is multi-Dimensional

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [3]:
gen=pd.Series(["M","A","N","I","S","H"])

In [4]:
print(gen)

0    M
1    A
2    N
3    I
4    S
5    H
dtype: object

In [5]:
type(gen)

pandas.core.series.Series

In [8]:
dict={"M":"1","A":"2","N":"3","I":"4","S":"5","H":'6'}

In [9]:
print(dict)

{'M': '1', 'A': '2', 'N': '3', 'I': '4', 'S': '5', 'H': '6'}

In [13]:
dic_1=pd.Series(dict)

In [14]:
dic_1.index

Index(['M', 'A', 'N', 'I', 'S', 'H'], dtype='object')

In [15]:
dic_1.values

array(['1', '2', '3', '4', '5', '6'], dtype=object)

In [16]:
list=["2023-01-22","Manish",21.37,True]
ser=pd.Series(list)

In [17]:
print(ser)

0    2023-01-22
1        Manish
2         21.37
3          True
dtype: object

In [18]:
ser.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
ser.values

array(['2023-01-22', 'Manish', 21.37, True], dtype=object)

### DataFrames

In [28]:
df=pd.DataFrame({"First_Name":["Manish","Avinash","Himanshu","Ankit"],"Last_Name":["Dubey","Pandey","Upadhaya","Dubey"]})
df

  First_Name Last_Name
0     Manish     Dubey
1    Avinash    Pandey
2   Himanshu  Upadhaya
3      Ankit     Dubey

In [25]:
pd.Series({"First_Name":["Manish","Avinash","Himanshu","Ankit"],"Last_Name":["Dubey","Pandey","Upadhaya","Dubey"]})

In [29]:
df{"Last_Name"}

SyntaxError: invalid syntax (903576060.py, line 1)

In [30]:
df["Last_Name"]

0       Dubey
1      Pandey
2    Upadhaya
3       Dubey
Name: Last_Name, dtype: object

In [31]:
df["mistake"]

KeyError: 'mistake'

In [32]:
type(df["Last_Name"])

pandas.core.series.Series

In [33]:
df[]

SyntaxError: invalid syntax (1951995059.py, line 1)

In [34]:
df[""]

KeyError: ''

In [35]:
df["First_Name"][3]

'Ankit'

In [36]:
ser1=pd.Series([0,1,2,3,4,5],index=[0,1,2,3,2,1])
ser2=pd.Series([0,1,2,3,4],index=[1,2,3,4,5])

In [37]:
ser1

0    0
1    1
2    2
3    3
2    4
1    5
dtype: int64

In [38]:
ser2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [39]:
ser1+ser2

0    NaN
1    1.0
1    5.0
2    3.0
2    5.0
3    5.0
4    NaN
5    NaN
dtype: float64

In [40]:
## It will work in such a way such that key value in both the series will get an opereation with himself
## like->key-1 of series1 will get add with key-1 value of series2.

In [45]:
ser1=pd.Series([1,2,3],index=["Cricket","Football","Badminton"])
ser2=pd.Series([5,7,8,2],index=["Cricket","Football","Badminton","Cricket"])

In [46]:
ser1

Cricket      1
Football     2
Badminton    3
dtype: int64

In [47]:
ser2

Cricket      5
Football     7
Badminton    8
Cricket      2
dtype: int64

In [48]:
ser1+ser2

Badminton    11
Cricket       6
Cricket       3
Football      9
dtype: int64

In [49]:
ser1.sum()

6

In [50]:
ser2.sum()

22

In [51]:
ser1.min()

1

In [52]:
ser2.max()

8

In [54]:
ser1.index

Index(['Cricket', 'Football', 'Badminton'], dtype='object')

In [55]:
ser2.index

Index(['Cricket', 'Football', 'Badminton', 'Cricket'], dtype='object')

In [56]:
ser1.index+ser2.index

ValueError: operands could not be broadcast together with shapes (3,) (4,)

In [58]:
ser1.sort_values()

Cricket      1
Football     2
Badminton    3
dtype: int64

In [59]:
ser1.sort_index()

Badminton    3
Cricket      1
Football     2
dtype: int64

In [60]:
ser1.std()

1.0

In [61]:
ser2.std()

2.6457513110645907

In [62]:
plus_10=lambda x:x+10

In [63]:
plus_10(5)

15

In [68]:
ser3=pd.Series([11,22,33],name="Roll_No")

In [69]:
ser3.apply(lambda x:x+15)

0    26
1    37
2    48
Name: Roll_No, dtype: int64

In [70]:
## By using lambda functio all the value get added by the value 15

###          End

### Intermediate level of dataSet

In [2]:
import pandas as pd

In [6]:
df=pd.read_csv("iris.data")

FileNotFoundError: [Errno 2] No such file or directory: 'iris.data'

In [13]:
columns=["A","B"]
df=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Datasets/main/hotel_bookings.csv",header=None)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9952\866883286.py:2: DtypeWarning: Columns (1,2,3,5,6,7,8,9,10,11,16,17,18,21,23,24,25,27,28,29) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Datasets/main/hotel_bookings.csv",header=None)

In [14]:
df.head(10)

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
0,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
1,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0,0,0,Check-Out,07-01-2015
2,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0,0,0,Check-Out,07-01-2015
3,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,NaN,0,Transient,75,0,0,Check-Out,07-02-2015
4,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304,NaN,0,Transient,75,0,0,Check-Out,07-02-2015
5,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240,NaN,0,Transient,98,0,1,Check-Out,07-03-2015
6,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240,NaN,0,Transient,98,0,1,Check-Out,07-03-2015
7,Resort Hotel,0,0,2015,July,27,1,0,2,2,...,No Deposit,NaN,NaN,0,Transient,107,0,0,Check-Out,07-03-2015
8,Resort Hotel,0,9,2015,July,27,1,0,2,2,...,No Deposit,303,NaN,0,Transient,103,0,1,Check-Out,07-03-2015
9,Resort Hotel,1,85,2015,July,27,1,0,3,2,...,No Deposit,240,NaN,0,Transient,82,0,1,Canceled,05-06-2015

In [15]:
df.sample()

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
4191,Resort Hotel,1,30,2016,February,9,26,1,2,2,...,No Deposit,240,NaN,0,Transient,48,0,3,Canceled,2/21/2016

In [12]:
## .sample will show any data randomly from the data set

In [18]:
df.sample(10)

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
7811,Resort Hotel,1,219,2016,August,35,27,4,6,2,...,No Deposit,240,NaN,0,Transient,134,0,1,Canceled,07-11-2016
38843,Resort Hotel,0,0,2017,July,30,28,1,2,2,...,No Deposit,306.0,NaN,0,Transient,102.73,0,0,Check-Out,7/31/2017
109326,City Hotel,0,0,2017,April,15,9,1,0,2,...,No Deposit,NaN,NaN,0,Transient,135.0,0,2,Check-Out,04-10-2017
65782,City Hotel,1,117,2017,April,14,8,2,1,1,...,No Deposit,9.0,NaN,0,Transient,109.8,0,1,Canceled,01-09-2017
46331,City Hotel,1,140,2015,December,53,29,0,5,2,...,Non Refund,3.0,NaN,0,Transient,70.0,0,0,Canceled,10/19/2015
25595,Resort Hotel,0,170,2016,July,27,2,0,1,2,...,No Deposit,242.0,NaN,0,Transient,107.1,0,2,Check-Out,07-03-2016
99269,City Hotel,0,17,2016,October,41,7,2,2,2,...,No Deposit,7.0,NaN,0,Transient,117.04,0,1,Check-Out,10-11-2016
43953,City Hotel,1,88,2015,September,39,26,2,2,2,...,Non Refund,1.0,NaN,0,Transient,170.0,0,0,Canceled,09-09-2015
106055,City Hotel,0,11,2017,February,8,19,1,0,2,...,No Deposit,9.0,NaN,0,Transient,100.0,0,0,Check-Out,2/20/2017
95359,City Hotel,0,63,2016,August,34,15,1,2,2,...,No Deposit,28.0,NaN,0,Transient,63.75,0,0,Check-Out,8/18/2016

In [17]:
df.tail()

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
119386,City Hotel,0,23,2017,August,35,30,2,5,2,...,No Deposit,394.0,NaN,0,Transient,96.14,0,0,Check-Out,09-06-2017
119387,City Hotel,0,102,2017,August,35,31,2,5,3,...,No Deposit,9.0,NaN,0,Transient,225.43,0,2,Check-Out,09-07-2017
119388,City Hotel,0,34,2017,August,35,31,2,5,2,...,No Deposit,9.0,NaN,0,Transient,157.71,0,4,Check-Out,09-07-2017
119389,City Hotel,0,109,2017,August,35,31,2,5,2,...,No Deposit,89.0,NaN,0,Transient,104.4,0,0,Check-Out,09-07-2017
119390,City Hotel,0,205,2017,August,35,29,2,7,2,...,No Deposit,9.0,NaN,0,Transient,151.2,0,2,Check-Out,09-07-2017

In [20]:
df.shape

(119391, 32)

In [21]:
## shape will show the number of rows and columns in the data set.

In [22]:
df.columns

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
           dtype='int64')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119391 entries, 0 to 119390
Data columns (total 32 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       119391 non-null  object
 1   1       119391 non-null  object
 2   2       119391 non-null  object
 3   3       119391 non-null  object
 4   4       119391 non-null  object
 5   5       119391 non-null  object
 6   6       119391 non-null  object
 7   7       119391 non-null  object
 8   8       119391 non-null  object
 9   9       119391 non-null  object
 10  10      119387 non-null  object
 11  11      119391 non-null  object
 12  12      119391 non-null  object
 13  13      118903 non-null  object
 14  14      119391 non-null  object
 15  15      119391 non-null  object
 16  16      119391 non-null  object
 17  17      119391 non-null  object
 18  18      119391 non-null  object
 19  19      119391 non-null  object
 20  20      119391 non-null  object
 21  21      119391 non-null  object
 22  22      119391 non-null  object
 23  23      103051 non-null  object
 24  24      6798 non-null    object
 25  25      119391 non-null  object
 26  26      119391 non-null  object
 27  27      119391 non-null  object
 28  28      119391 non-null  object
 29  29      119391 non-null  object
 30  30      119391 non-null  object
 31  31      119391 non-null  object
dtypes: object(32)
memory usage: 29.1+ MB

In [24]:
df.dtypes

0     object
1     object
2     object
3     object
4     object
5     object
6     object
7     object
8     object
9     object
10    object
11    object
12    object
13    object
14    object
15    object
16    object
17    object
18    object
19    object
20    object
21    object
22    object
23    object
24    object
25    object
26    object
27    object
28    object
29    object
30    object
31    object
dtype: object

In [25]:
df.isnull()

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,True,True,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,True,True,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,True,True,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119386,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False
119387,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False
119388,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False
119389,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False
119390,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,False,False,False

In [26]:
## false represent no missing value in data set and true represent missing value in the data set.

In [28]:
df.isnull().sum()

0          0
1          0
2          0
3          0
4          0
5          0
6          0
7          0
8          0
9          0
10         4
11         0
12         0
13       488
14         0
15         0
16         0
17         0
18         0
19         0
20         0
21         0
22         0
23     16340
24    112593
25         0
26         0
27         0
28         0
29         0
30         0
31         0
dtype: int64

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df.describe()

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
count,119391,119391,119391,119391,119391,119391,119391,119391,119391,119391,...,119391,103051.0,6798.0,119391,119391,119391.0,119391,119391,119391,119391
unique,3,5,870,7,13,107,63,31,60,20,...,4,456.0,458.0,149,5,10936.0,9,13,4,927
top,City Hotel,0,0,2016,August,33,17,0,2,2,...,No Deposit,9.0,40.0,0,Transient,62.0,0,0,Check-Out,10/21/2015
freq,79330,69532,5747,50100,13877,2889,3816,46840,30710,76269,...,104641,31956.0,927.0,99472,89613,3711.0,96637,60250,75166,1461

In [31]:
df.describe(include="all")

,0,1,2,3,4,5,6,7,8,9,...,22,23,24,25,26,27,28,29,30,31
count,119391,119391,119391,119391,119391,119391,119391,119391,119391,119391,...,119391,103051.0,6798.0,119391,119391,119391.0,119391,119391,119391,119391
unique,3,5,870,7,13,107,63,31,60,20,...,4,456.0,458.0,149,5,10936.0,9,13,4,927
top,City Hotel,0,0,2016,August,33,17,0,2,2,...,No Deposit,9.0,40.0,0,Transient,62.0,0,0,Check-Out,10/21/2015
freq,79330,69532,5747,50100,13877,2889,3816,46840,30710,76269,...,104641,31956.0,927.0,99472,89613,3711.0,96637,60250,75166,1461

In [32]:
df.index

RangeIndex(start=0, stop=119391, step=1)

In [34]:
df.columns=["A","B","C"]

ValueError: Length mismatch: Expected axis has 32 elements, new values have 3 elements

In [35]:
## it is showing error because we have to write 32 column name but we are writing only 3.

In [40]:
df[[6,3]]

                                6                  3
0       arrival_date_day_of_month  arrival_date_year
1                               1               2015
2                               1               2015
3                               1               2015
4                               1               2015
...                           ...                ...
119386                         30               2017
119387                         31               2017
119388                         31               2017
119389                         31               2017
119390                         29               2017

[119391 rows x 2 columns]

In [127]:
df=pd.DataFrame([["Name","Age","Sex"],["Latha","23","Female"],["Karan","54","Male"]])

In [128]:
df

       0    1       2
0   Name  Age     Sex
1  Latha   23  Female
2  Karan   54    Male

In [126]:
dff=pd.DataFrame([["Latha","23","Female"],["Karan","54","Male"]],columns=[["Name","Age","Sex"]])

In [59]:
dff

    Name Age     Sex
0  Latha  23  Female
1  Karan  54    Male

In [60]:
dff.index

RangeIndex(start=0, stop=2, step=1)

In [66]:
dff.index=["name1","name2"]
dff

        Name Age     Sex
name1  Latha  23  Female
name2  Karan  54    Male

In [67]:
dff.index

Index(['name1', 'name2'], dtype='object')

In [68]:
dff.rename(index={"name1":"name_1"},inplace=True)

In [69]:
dff

         Name Age     Sex
name_1  Latha  23  Female
name2   Karan  54    Male

In [70]:
dff.rename(index={"name2":"name_2"},inplace=True)

In [71]:
dff

         Name Age     Sex
name_1  Latha  23  Female
name_2  Karan  54    Male

In [73]:
dff.rename(columns={"Name":"name"},inplace=True)

In [74]:
dff

         name Age     Sex
name_1  Latha  23  Female
name_2  Karan  54    Male

In [75]:
scores={"math":[78,45,71],'eng':[34,89,96],"env":[49,56,87]}

In [76]:
scores

{'math': [78, 45, 71], 'eng': [34, 89, 96], 'env': [49, 56, 87]}

In [77]:
## we have to data frame of the above data.

In [78]:
df=pd.DataFrame([[78,45,71],[34,89,96],[49,56,87]],index=[["math",'eng',"env"]])

In [79]:
df

       0   1   2
math  78  45  71
eng   34  89  96
env   49  56  87

In [137]:
df=pd.DataFrame(scores,index=["name1","name2","name3"])

In [132]:
df

       math  eng  env
name1    78   34   49
name2    45   89   56
name3    71   96   87

In [82]:
df1=df[:]

In [86]:
df1.drop("name2")

       math  eng  env
name1    78   34   49
name3    71   96   87

In [87]:
df1

       math  eng  env
name1    78   34   49
name2    45   89   56
name3    71   96   87

In [88]:
## Actually drop command is use to remove the paticular index from the data set but after again running the same change data set it 
## is showing again all the previous three value as you can see in above example.To overcome from this problem we write inplace=True.

In [89]:
df1.drop("name2",inplace=True)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9952\1152387549.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop("name2",inplace=True)

In [90]:
df1

       math  eng  env
name1    78   34   49
name3    71   96   87

In [92]:
df1.drop("eng",axis=1)

       math  env
name1    78   49
name3    71   87

In [93]:
## To replace column we write axis and inplace.

In [117]:
df1

Empty DataFrame
Columns: []
Index: [name1, name3]

In [118]:
df1.drop("eng",axis=1,inplace=True)

KeyError: "['eng'] not found in axis"

In [97]:
df1

       math  env
name1    78   49
name3    71   87

In [98]:
df1.drop({"math","env"},axis=1,inplace=True)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9952\39084014.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop({"math","env"},axis=1,inplace=True)

#

In [99]:
df1

Empty DataFrame
Columns: []
Index: [name1, name3]

In [115]:
df

     math  eng
env
49     78   34
56     45   89
87     71   96

In [116]:
df.loc[{"name1","name2"}]

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9952\1017038954.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  df.loc[{"name1","name2"}]

KeyError: "None of [Index(['name1', 'name2'], dtype='object', name='env')] are in the [index]"

In [123]:
df

     math  eng
env
49     78   34
56     45   89
87     71   96

In [135]:
df.set_index("env",inplace=True)

In [136]:
df

     math  eng
env
49     78   34
56     45   89
87     71   96

In [107]:
## env column is change to index.

In [134]:
df

       math  eng  env
name1    78   34   49
name2    45   89   56
name3    71   96   87

In [133]:
df.iloc[0,1:]

eng    34
env    49
Name: name1, dtype: int64

In [138]:
df.iloc[1,1:]

eng    89
env    56
Name: name2, dtype: int64

In [139]:
## Here 1->row and 1:-> repesent column after 0 column.

In [140]:
df.iloc[0,2]

49

In [141]:
df.iloc[[0,1],[1,2]]

       eng  env
name1   34   49
name2   89   56

In [145]:
df["hindi"]=80,91,85

In [146]:
df

       math  eng  env  hindi
name1    78   34   49     80
name2    45   89   56     91
name3    71   96   87     85

In [147]:
df.loc["name4"]=43

In [148]:
df

       math  eng  env  hindi
name1    78   34   49     80
name2    45   89   56     91
name3    71   96   87     85
name4    43   43   43     43

In [149]:
df.loc["name4"]=76,43,98,65

In [150]:
df

       math  eng  env  hindi
name1    78   34   49     80
name2    45   89   56     91
name3    71   96   87     85
name4    76   43   98     65

### END